## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_eks_cluster.notify_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "notify_cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "notification-canada-ca-production-eks-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks-assume-role-policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notification-service-account",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_blazer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_blazer" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:tools:blazer",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_github will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_github" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:github-arc-controller:github-arc-gha-rs-controller",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_nginx will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_nginx" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:nginx:ingress-nginx-ingress",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_security_group.eks-securitygroup-rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "eks-securitygroup-rds" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = "sg-09e3175f46bc85607"
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # data.tls_certificate.notification-canada-ca will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "notification-canada-ca" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
    }

  # aws_cloudwatch_log_metric_filter.celery-error[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "celery-error" {
        id             = "celery-error"
        name           = "celery-error"
      ~ pattern        = "?\"ERROR/*Worker\" ?\"ERROR/MainProcess\"" -> "%ERROR/.*Worker|ERROR/MainProcess%"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_eks_addon.coredns will be updated in-place
  ~ resource "aws_eks_addon" "coredns" {
      ~ addon_version               = "v1.11.1-eksbuild.9" -> "v1.11.3-eksbuild.1"
        id                          = "notification-canada-ca-production-eks-cluster:coredns"
        tags                        = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_driver will be updated in-place
  ~ resource "aws_eks_addon" "ebs_driver" {
      ~ addon_version               = "v1.31.0-eksbuild.1" -> "v1.35.0-eksbuild.1"
        id                          = "notification-canada-ca-production-eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
        # (10 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version               = "v1.30.0-eksbuild.3" -> "v1.31.0-eksbuild.5"
        id                          = "notification-canada-ca-production-eks-cluster:kube-proxy"
        tags                        = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eks_addon.vpc_cni will be updated in-place
  ~ resource "aws_eks_addon" "vpc_cni" {
      ~ addon_version               = "v1.18.1-eksbuild.3" -> "v1.18.5-eksbuild.1"
        id                          = "notification-canada-ca-production-eks-cluster:vpc-cni"
        tags                        = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eks_cluster.notification-canada-ca-eks-cluster will be updated in-place
  ~ resource "aws_eks_cluster" "notification-canada-ca-eks-cluster" {
        id                            = "notification-canada-ca-production-eks-cluster"
        name                          = "notification-canada-ca-production-eks-cluster"
        tags                          = {
            "CostCenter" = "notification-canada-ca-production"
            "Name"       = "notification-canada-ca"
        }
      ~ version                       = "1.30" -> "1.31"
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version        = "1.30.4-20240928" -> "1.31.0-20241011"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
        id              = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.notification-service-account-role will be updated in-place
  ~ resource "aws_iam_role" "notification-service-account-role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "notification-service-account-role"
        name                  = "notification-service-account-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.secrets_csi_blazer will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_blazer" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:tools:blazer"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-blazer"
        name                  = "secrets-csi-role-blazer"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.secrets_csi_github will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_github" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:github-arc-controller:github-arc-gha-rs-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-github"
        name                  = "secrets-csi-role-github"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.secrets_csi_nginx will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_nginx" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-nginx"
        name                  = "secrets-csi-role-nginx"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20241009160942480900000002" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20241009160942480900000002" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_assumable_role_karpenter.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement (known after apply)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sts:TagSession",
                          - "sts:AssumeRoleWithWebIdentity",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "karpenter-controller-eks"
        name                  = "karpenter-controller-eks"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 14 to change, 1 to destroy.

Changes to Outputs:
  ~ eks_cluster_endpoint                      = "https://BB1100A5BF4708019EB3830B49BF6B60.sk1.ca-central-1.eks.amazonaws.com" -> (known after apply)

Error: External Program Lookup Failed

  with data.external.get_pca_arn,
  on vpn.tf line 98, in data "external" "get_pca_arn":
  98:   program = ["../../../../../../../scripts/getPCAARN.sh"]

The data source received an unexpected error while attempting to parse the
query. The data source received an unexpected error while attempting to find
the program.

The program must be accessible according to the platform where Terraform is
running.

If the expected program should be automatically found on the platform where
Terraform is running, ensure that the program is in an expected directory. On
Unix-based platforms, these directories are typically searched based on the
'$PATH' environment variable. On Windows-based platforms, these directories
are typically searched based on the '%PATH%' environment variable.

If the expected program is relative to the Terraform configuration, it is
recommended that the program name includes the interpolated value of
'path.module' before the program name to ensure that it is compatible with
varying module usage. For example: "${path.module}/my-program"

The program must also be executable according to the platform where Terraform
is running. On Unix-based platforms, the file on the filesystem must have the
executable bit set. On Windows-based platforms, no action is typically
necessary.

Platform: linux
Program: "../../../../../../../scripts/getPCAARN.sh"
Error: exec: "../../../../../../../scripts/getPCAARN.sh": stat
../../../../../../../scripts/getPCAARN.sh: no such file or directory
time=2024-10-28T19:28:17Z level=error msg=terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/production/eks/.terragrunt-cache/CUvrBZ1YLC6h5MEnN_bw0DCIi18/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/eks error=[/home/runner/work/notification-terraform/notification-terraform/env/production/eks/.terragrunt-cache/CUvrBZ1YLC6h5MEnN_bw0DCIi18/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/eks] exit status 1 prefix=[/home/runner/work/notification-terraform/notification-terraform/env/production/eks] 
time=2024-10-28T19:28:17Z level=error msg=1 error occurred:
	* [/home/runner/work/notification-terraform/notification-terraform/env/production/eks/.terragrunt-cache/CUvrBZ1YLC6h5MEnN_bw0DCIi18/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/eks] exit status 1



```

</details>

